Enums/абс_ВидыОперацийВводБюджета/абс_ВидыОперацийВводБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийВводБюджета</name>
  <enumValues>
    <name>Бюджет</name>
  </enumValues>
  <enumValues>
    <name>КорПлан</name>
  </enumValues>
  <enumValues>
    <name>ОперативныйФакт</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскийФакт</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
</mdclass:Enum>

Catalogs/СценарииПланирования/СценарииПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СценарииПланирования</name>
  <comment>(Упр)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БухгалтерскийФакт</name>
      <description>Бухгалтерский факт</description>
    </items>
    <items>
      <name>Бюджет</name>
      <description>Бюджет</description>
    </items>
    <items>
      <name>ОперативныйФакт</name>
      <description>Оперативный факт</description>
    </items>
    <items>
      <name>План</name>
      <description>План</description>
    </items>
    <items>
      <name>Факт</name>
      <description>Факт</description>
    </items>
  </predefined>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияПланирования</name>
    <type>
      <types>EnumRef.ДетализацияПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетПоСуммам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетПоКоличеству</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>Валюта данных сценария</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПланирования</name>
    <type>
      <types>EnumRef.СпособыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЦикла</name>
    <comment>Продолжительность цикла планирования по сценарию (в периодах планирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПлана</name>
    <comment>Начало интервала планирования</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПлана</name>
    <comment>Конец интервала планирования</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаДоходности</name>
    <comment>Годовая норма доходности для сценария</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКурсыСценария</name>
    <comment>Признак использования отдельной линейки курсов валют для сценария</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипСценарияПланирования</name>
    <type>
      <types>EnumRef.абс_ТипСценарияПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаВерсии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

CommonModules/абс_Бюджетирование/Module.bsl
Функция ПолучитьСценарийПоВидуОперации(ВидОперации) Экспорт
	
	Если ЗначениеЗаполнено(ВидОперации) Тогда
		Если ВидОперации=Перечисления.абс_ВидыОперацийВводБюджета.Бюджет Тогда
			Возврат Справочники.СценарииПланирования.Бюджет;
		ИначеЕсли ВидОперации=Перечисления.абс_ВидыОперацийВводБюджета.КорПлан Тогда
			Возврат Справочники.СценарииПланирования.План;
		ИначеЕсли ВидОперации=Перечисления.абс_ВидыОперацийВводБюджета.ОперативныйФакт Тогда
			Возврат Справочники.СценарииПланирования.ОперативныйФакт;
		ИначеЕсли ВидОперации=Перечисления.абс_ВидыОперацийВводБюджета.БухгалтерскийФакт Тогда
			Возврат Справочники.СценарииПланирования.БухгалтерскийФакт;			
		ИначеЕсли ВидОперации=Перечисления.абс_ВидыОперацийВводБюджета.Факт Тогда
			Возврат Справочники.СценарииПланирования.Факт;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
